admbase/src/Documents/РасчетСтоимостиПроживания/РасчетСтоимостиПроживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетСтоимостиПроживания</name>
  <registerRecords>AccumulationRegister.СтоимостьПроживанияСотрудников</registerRecords>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДетальныеЗаписи</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>CatalogRef.АдресаРегистрации</types>
      </type>
    </attributes>
    <attributes>
      <name>Комната</name>
      <type>
        <types>CatalogRef.КомнатыВагоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

admbase/src/AccumulationRegisters/СтоимостьПроживанияСотрудников/СтоимостьПроживанияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьПроживанияСотрудников</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АдресаРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

admbase/src/Documents/РасчетСтоимостиПроживания/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	
#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ
	|	РасчетСтоимостиПроживания.Ссылка КАК Регистратор,
	|	РасчетСтоимостиПроживания.ПериодРасчета КАК Период,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.Сотрудник,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.АдресРегистрации,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.Комната,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.Место,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.Стоимость,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.Всего КАК Сумма,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.КоличествоДней КАК Количество,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.ДатаНачала,
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.ДатаОкончания
	|ИЗ
	|	Документ.РасчетСтоимостиПроживания.ДетальныеЗаписи КАК РасчетСтоимостиПроживанияДетальныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСтоимостиПроживания КАК РасчетСтоимостиПроживания
	|		ПО РасчетСтоимостиПроживанияДетальныеЗаписи.Ссылка = РасчетСтоимостиПроживания.Ссылка
	|ГДЕ
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетСтоимостиПроживанияДетальныеЗаписи.НомерСтроки";
#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.СтоимостьПроживанияСотрудников.Добавить(),Выборка);
	КонецЦикла;

	Движения.СтоимостьПроживанияСотрудников.Записывать = Истина;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
